app/Controllers/Base/Pengirimanbarang.php

SELECT *
FROM `pengiriman`
SELECT *
FROM `stok_barang`
SELECT *
FROM `lokasi`
---
    public function pengiriman()
    {
        $pengiriman = new Pengiriman();
        $stok = new Stok;
        $lokasi = new Lokasi();

        $pending = $this->pengiriman->get_status();
        $success = $this->pengiriman->status_success();
        $leadup = $this->pengiriman->status_leadUp();
        $pending_pen = $this->penerimaan->pending();

        $data['pending_pen']= $pending_pen;
        $data['pengiriman']= $pengiriman->findAll();
        $data['stokBarang']=$stok->findAll();
        $data['lokasi']=$lokasi->findAll();