app/Controllers/Base/Pengguna.php

SELECT *
FROM `user`
SELECT *
FROM `stok_barang`
SELECT *
FROM `lokasi`
---
    public function user()
    {
        $user = new User();
        $lokasi = new Lokasi();
        $stok = new Stok();

        $pending = $this->pengiriman->get_status();
        $success = $this->pengiriman->status_success();
        $leadup = $this->pengiriman->status_leadUp();
        $pending_pen = $this->penerimaan->pending();

        $data['pending_pen']= $pending_pen;
        $data['user'] = $user->findAll();
        $data['stokBarang']=$stok->findAll();
        $data['lokasi'] = $lokasi->findAll();