app/Controllers/Base/StokBarang.php

    public function stok()
    {
        $stok = new Stok;
        $barang = new Barang();
        $lokasi = new Lokasi();

        $pending = $this->pengiriman->get_status();
        $success = $this->pengiriman->status_success();
        $leadup = $this->pengiriman->status_leadUp();
        $pending_pen = $this->penerimaan->pending();

        $data['pending_pen']= $pending_pen;
        $data['success'] = $success;

        $data['pending'] = $pending;
		$data['leadup'] = $leadup;

        $data['lokasi']=$lokasi->findAll();
        $data['barang'] = $barang->findAll();
        $data['stokBarang']=$stok->findAll();
---
SELECT *
FROM `lokasi`
SELECT *
FROM `barang`
SELECT *
FROM `stok_barang`

    public function add_stok()
    {
        $stock = new Stok;
        $barang = new Barang;

        $valid = \Config\Services::validation();
        $valid->setRules(['qty' => 'required']);
        $isvalid = $valid->withRequest($this->request)->run();

        $alias=$this->request->getPost('alias');
        $name=ucfirst($alias);
        $created_by=$this->request->getPost('created_by');
        $qty=$this->request->getPost('qty');
        $satuan=$this->request->getPost('satuan');
        $deskripsi=$this->request->getPost('deskripsi');
        $get_stock = $stock->where('alias', $alias)->first();

        // return json_encode($get_stock['qty'] + ($qty / 1000));
        if($isvalid){
            // barang masuk
            $do_insert = $barang->insert([
                // "alias"=>$name,
                "alias"=>$alias,
                "created_by"=>$created_by,
                "qty"=>$qty,
                "satuan"=>$satuan,
                "deskripsi"=>$deskripsi
            ]);
---
INSERT INTO `barang` (`alias`, `created_by`, `qty`, `satuan`, `deskripsi`) VALUES ('bonteng', 'rafi', '0.3', 'kg', '')