app/Controllers/Home.php

	public function index()
	{
		$this->session = session();
        $this->user = new User();

		$penerimaan = new Penerimaan();
		$stok = new Stok();
		$pengiriman = new Pengiriman();
		$selesai = new CatatanLaporan();
		$barang_masuk = new Barang();
		$barang_keluar = new BarangKeluar();
		$user = new User();
		$lokasi = new Lokasi();

        $pending = $pengiriman->get_status();
        $success = $pengiriman->status_success();
        $leadup = $pengiriman->status_leadUp();
		$pending_pen = $penerimaan->pending();

        $data['pending_pen']= $pending_pen;
		$data['selesai'] = $selesai->findAll();
		$data['pengiriman'] = $pengiriman->findAll();
		$data['stok'] = $stok->findAll();
		$data['penerimaan'] = $penerimaan->findAll();
		$data['barang_masuk'] = $barang_masuk->findAll();
		$data['barang_keluar'] = $barang_keluar->findAll();
		$data['user'] = $user->findAll();
		$data['lokasi'] = $lokasi->findAll();
---
SELECT *
FROM `catatan_laporan`
SELECT *
FROM `pengiriman`
SELECT *
FROM `penerimaan`
SELECT *
FROM `barang`
SELECT *
FROM `barang_keluar`
SELECT *
FROM `user`
SELECT *
FROM `lokasi`