app/Models/barang/Penerimaan.php

    public function pending()
    {
        $builder = $this->penerimaan;
        $builder->select('id');
        $builder->where('status', 0);
        $query = $builder->get();
---
SELECT `id`
FROM `penerimaan`
WHERE `status` = 0