app/Models/barang/Pengiriman.php

    public function get_status()
    {

        // builder adalah database pengiriman
        $builder = $this->pengiriman;
        // pilih idnya
        $builder->select('id');
        // dimana id yang berstatus 0
        $builder->where('status', 0);
        // tampilkan hasil dari query
        $query = $builder->get();
---
SELECT `id`
FROM `pengiriman`
WHERE `status` = 0

    public function status_success()
    {
        $builder = $this->pengiriman;
        $builder->select('id');
        $builder->where('status', 1);
        $query = $builder->get();
---
SELECT `id`
FROM `pengiriman`
WHERE `status` = 1

    public function status_leadUp()
    {
        $builder = $this->pengiriman;
        $builder->select('id');
        $builder->where('status', 3);
        $query = $builder->get();
---
SELECT `id`
FROM `pengiriman`
WHERE `status` = 3