app/Models/barang/User.php

SELECT `name`
FROM `user`
WHERE `id` = '1'
---
    public function get_name($id){
        $builder = $this->user;
        $builder->select('name');
        $builder->where('id', $id);
        $query = $builder->get();